In [3]:
import pandas as pd

from sklearn.feature_selection import SelectKBest

In [5]:
df = pd.DataFrame({'A':[1,2,3,4], 'B':[20,60,99,80]})

In [6]:
df

   A   B
0  1  20
1  2  60
2  3  99
3  4  80

In [7]:
(
    df
    .assign(C = df['A'] ** 2)
)

   A   B   C
0  1  20   1
1  2  60   4
2  3  99   9
3  4  80  16

In [10]:
(
    df
    .assign(D = lambda x: x['B']*2
    
    
    )
)

   A   B    D
0  1  20   40
1  2  60  120
2  3  99  198
3  4  80  160

In [11]:
(
    df
    .assign(C = df['A'] ** 2,
            
            D = lambda x: x['B']*2          
               
           )
)

   A   B   C    D
0  1  20   1   40
1  2  60   4  120
2  3  99   9  198
3  4  80  16  160

In [ ]:
(
    df
    .assign(C = df['A'] ** 2,
            
            D = lambda x: x['B']*2          
               
           )
    .s
)